//=============================Метод объекта==================================

// 1. Метод объекта

// способы создания метода объекта


//=============================this==================================

// this

// Что это такое?
// Какой тип данных?
// Чему равен?

// для чего это?

// доказательство что это такое


//=============================call, bind, apply==================================

// call, bind, apply
// что за методы?
// для чего нужны?
// что принимают в качестве параметров?

// call

// apply

// bind


//=============================Случаи потери контекста==================================



//=============================Функция-конструктор==================================

// Функция-конструктор

// для чего нужна

// Правила при работе с функцией конструктор

// Базовая запись

// Разница по сравнению с обычной функцией (что возвращают)

// Что делать, если нужно добавить свойство?



// ---------------------------------- Задачи -----------------------------------------------

/*
1. Создайте объект car, у которого есть свойство brand и метод getBrand,
который выводит название марки машины.
Вызовите метод getBrand как метод объекта car.

2. Создайте объект counter, у которого есть свойство count и методы increment, decrement и reset,
которые увеличивают, уменьшают, зануляют (сбрасывает) значение счетчика соответственно.
Используйте ключевое слово this для обращения к свойству count.

3. Создайте объект person, у которого есть свойства name и age.
Создайте метод greet, который выводит сообщение с именем и возрастом персоны.
Используйте метод bind для создания новой функции,
которая будет связывать значение this с объектом person.

4. Создайте объект calculator, у которого есть свойства x и y и методы сложения и умножения этих чисел.
Создайте другой объект user, у которого есть свойства a и b.
Используйте метод call или apply для вызова методов объекта calculator с аргументами из объекта user.
 */









